app/controllers/admin/cities_controller.rb

  def index
    @cities = City.where('description like :filter Or uf Like :filter', {filter: "%#{params[:q]}%"}).page params[:page]
---
SELECT COUNT(*) FROM `cities` WHERE (description like '%%' Or uf Like '%%')
SELECT `cities`.* FROM `cities` WHERE (description like '%%' Or uf Like '%%') LIMIT 25 OFFSET 0